**Terraform Plan Output:**
```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.route53.aws_iam_instance_profile.ec2_instance_profile has changed
  ~ resource "aws_iam_instance_profile" "ec2_instance_profile" {
        id          = "ec2-instance-profile"
        name        = "ec2-instance-profile"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }

  # module.sshkey.aws_key_pair.key_pair has changed
  ~ resource "aws_key_pair" "key_pair" {
        id              = "docker"
      + tags            = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ansible.data.template_file.ansible_inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "ansible_inventory" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [web]
            ${join("\n", [for ip in split(",", private_ips) : "${ip} ansible_user=ubuntu ansible_ssh_private_key_file=~/.ssh/ansible.pem"])}
        EOT
      + vars     = {
          + "private_ips" = (known after apply)
        }
    }

  # module.ansible.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/ansible/../../ansible/inventory.ini"
      + id                   = (known after apply)
    }

  # module.compute.aws_instance.app_instance[1] will be created
  + resource "aws_instance" "app_instance" {
      + ami                                  = "ami-07a63969ac0961461"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ec2-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "docker"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-024c23872aee441f0"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "865fa144d07d5fd0d9e82cbe863cd0e5c25c1d48"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0e41ce96bd7e37f27",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.sshkey.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/sshkey/../../dev/docker.pem"
      + id                   = (known after apply)
    }

  # module.templates.local_file.backend_var will be created
  + resource "local_file" "backend_var" {
      + content              = <<-EOT
            # Domain
            # This would be set to the production domain with an env var on deployment
            DOMAIN=localhost
            
            # Environment: local, staging, production
            ENVIRONMENT=local
            
            PROJECT_NAME="Full Stack FastAPI Project"
            STACK_NAME=full-stack-fastapi-project
            
            # Backend
            BACKEND_CORS_ORIGINS="http://dwaynechima.site,https://dwaynechima.site"
            SECRET_KEY=changethis123
            FIRST_SUPERUSER=chanllenge@devopsdojo.com
            FIRST_SUPERUSER_PASSWORD=devopsdojo57
            USERS_OPEN_REGISTRATION=True
            
            # Emails
            SMTP_HOST=
            SMTP_USER=
            SMTP_PASSWORD=
            EMAILS_FROM_EMAIL=info@example.com
            SMTP_TLS=True
            SMTP_SSL=False
            SMTP_PORT=587
            
            # Postgres
            POSTGRES_SERVER=database
            POSTGRES_PORT=5432
            POSTGRES_DB=app
            POSTGRES_USER=app
            POSTGRES_PASSWORD=changethis123
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/env/.backend-env"
      + id                   = (known after apply)
    }

  # module.templates.local_file.docker_compose_monitoring will be created
  + resource "local_file" "docker_compose_monitoring" {
      + content              = <<-EOT
            # ...................................Monitoring Stack .........................................................
            services:
            
            # Prometheus stack
              prometheus:
                image: prom/prometheus
                container_name: prometheus
                ports:
                  - "9090:9090"
                volumes:
                  - ./dependencies/scripts/prometheus.yaml:/etc/prometheus/prometheus.yml
                restart: always
                networks:
                  - app-network
            
              node-exporter:
                image: prom/node-exporter
                container_name: node-exporter
                ports:
                  - "9100:9100"
                restart: always
                networks:
                  - app-network
            
              blackbox_exporter:
                image: prom/blackbox-exporter
                container_name: blackbox_exporter
                ports:
                  - "9115:9115"
                volumes:
                  - ./dependencies/scripts/blackbox.yml:/etc/blackbox_exporter/blackbox.yml
                restart: always
                networks:
                  - app-network
            
            # Grafana stack
              grafana:
                image: grafana/grafana
                container_name: grafana
                environment:
                  - GF_SECURITY_ADMIN_USER=admin
                  - GF_SECURITY_ADMIN_PASSWORD=admin
                ports:
                  - "3000:3000"
                volumes:
                  - grafana_data:/var/lib/grafana
                  - ./dependencies/grafana/grafana.ini:/etc/grafana/grafana.ini
                  - ./dependencies/grafana/default.yaml:/etc/grafana/provisioning/dashboards/default.yaml
                  - ./dependencies/grafana/datasource.yaml:/etc/grafana/provisioning/datasources/datasources.yaml
                  - ./dependencies/grafana/dashboards:/var/lib/grafana/dashboards
                  - /etc/letsencrypt/live/dwaynechima.site/cert.pem:/etc/grafana/cert.perm
                  - /etc/letsencrypt/live/dwaynechima.site/privkey.pem:/etc/grafana/privkey.pem 
                restart: always
                depends_on:
                  - prometheus
                networks:
                  - app-network
            
              loki:
                image: grafana/loki
                container_name: loki
                volumes:
                  - ./dependencies/scripts/loki-config.yaml:/etc/loki/config.yaml
                command: -config.file=/etc/loki/local-config.yaml
                ports:
                  - "3100:3100"
                restart: always
                networks:
                  - app-network
            
            
              promtail:
                image: grafana/promtail
                container_name: promtail
                volumes:
                  - /var/log:/var/log
                  - /var/lib/docker/containers:/var/lib/docker/containers
                  - ./dependencies/scripts/promtail-config.yaml:/etc/promtail/config.yaml
                command: -config.file=/etc/promtail/config.yaml
                depends_on:
                  - loki
                restart: always
                networks:
                  - app-network
            
            
              cadvisor:
                image: gcr.io/cadvisor/cadvisor:latest
                container_name: cadvisor
                ports:
                  - "8081:8080"
                volumes:
                  - /:/rootfs:ro
                  - /var/run:/var/run:rw
                  - /sys:/sys:ro
                  - /var/lib/docker/:/var/lib/docker:ro
                restart: always
                networks:
                  - app-network
            
            networks:
              app-network:
                driver: bridge
            
            volumes:
              grafana_data:
              db-vol:
                driver: local
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/docker-compose-monitoring.yaml"
      + id                   = (known after apply)
    }

  # module.templates.local_file.frontend_var will be created
  + resource "local_file" "frontend_var" {
      + content              = "VITE_API_URL=https://dwaynechima.site"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/env/.frontend-env"
      + id                   = (known after apply)
    }

  # module.templates.local_file.grafana_ini will be created
  + resource "local_file" "grafana_ini" {
      + content              = <<-EOT
            [server]
            protocol = http
            http_port = 3000
            
            serve_from_sub_path = true
            
            domain = dwaynechima.site
            enforce_domain = true
            root_url = https://dwaynechima.site/grafana/
            cert_file = /etc/grafana/cert.pem
            cert_key = /etc/grafana/privkey.pem
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/grafana/grafana.ini"
      + id                   = (known after apply)
    }

  # module.templates.local_file.nginx_config will be created
  + resource "local_file" "nginx_config" {
      + content              = <<-EOT
            # Redirect HTTP to HTTPS for the main domain
            server {
                listen 80;
                server_name dwaynechima.site www.dwaynechima.site;
                return 301 https://$host$request_uri;
            }
            
            # Redirect www to non-www for the main domain
            server {
                listen 443 ssl;
                server_name www.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                return 301 https://dwaynechima.site$request_uri;
            }
            
            # Main domain (HTTPS)
            server {
                listen 443 ssl;
                server_name dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://frontend:5173; 
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
            
                location /grafana/ {
                    proxy_pass http://grafana:3000;
                    proxy_set_header Host $host;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /api {
                    proxy_pass http://backend:8000/api;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /docs {
                    proxy_pass http://backend:8000/docs;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /redoc {
                    proxy_pass http://backend:8000/redoc;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Redirect HTTP to HTTPS for subdomains
            server {
                listen 80;
                server_name proxy.dwaynechima.site db.dwaynechima.site prometheus.dwaynechima.site;
                return 301 https://$host$request_uri;
            }
            
            # Database subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name db.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://adminer:8080; 
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Proxy subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name proxy.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://proxy:81;  
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Prometheus subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name prometheus.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://prometheus:9090;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/nginx/nginx.conf"
      + id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ app_instance_ip          = [
        "3.84.201.42",
      + (known after apply),
    ]
  ~ app_instance_private_ips = [
        "10.0.0.116",
      + (known after apply),
    ]

```